In [193]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np
import geopandas as gpd

import matplotlib.pyplot as plt
import seaborn as sns

import folium

import plotly
import plotly.offline as py
import plotly.graph_objs as go
import plotly_express as px

from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

#import libraries
import re
from geopy.geocoders import GoogleV3
import shapely.geometry
import pyproj
import math
import requests
import time
from sklearn.cluster import KMeans
import matplotlib.cm as cm
import matplotlib.colors as colors

import datetime
import calendar
from sklearn.metrics import log_loss, f1_score
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics
import pickle
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report

In [194]:
df = pd.read_csv("train.csv")
df

,id,vendor_id,pickup_datetime,dropoff_datetime,passenger_count,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,trip_duration
0,id2875421,2,14-03-2016 17:24,14-03-2016 17:32,1,-73.982155,40.767937,-73.964630,40.765602,455
1,id2377394,1,12-06-2016 00:43,12-06-2016 00:54,1,-73.980415,40.738564,-73.999481,40.731152,663
2,id3858529,2,19-01-2016 11:35,19-01-2016 12:10,1,-73.979027,40.763939,-74.005333,40.710087,2124
3,id3504673,2,06-04-2016 19:32,06-04-2016 19:39,1,-74.010040,40.719971,-74.012268,40.706718,429
4,id2181028,2,26-03-2016 13:30,26-03-2016 13:38,1,-73.973053,40.793209,-73.972923,40.782520,435
...,...,...,...,...,...,...,...,...,...,...
1048570,id0002921,1,06-04-2016 14:16,06-04-2016 14:20,1,-73.973015,40.760948,-73.976387,40.755604,207
1048571,id1329189,2,24-03-2016 01:26,24-03-2016 01:38,1,-73.985550,40.727257,-73.957039,40.712387,740
1048572,id0408460,1,23-02-2016 16:38,23-02-2016 16:48,1,-73.972038,40.750202,-73.998360,40.733360,605
1048573,id0147762,1,24-05-2016 07:20,24-05-2016 07:25,1,-73.993332,40.724342,-74.004250,40.707470,287
1048574,id0859354,2,15-03-2016 22:00,15-03-2016 22:19,1,-73.988060,40.759548,-74.005585,40.711521,1169

In [195]:
del df['pickup_datetime']
del df['pickup_latitude']
del df['pickup_longitude']
del df['trip_duration']
del df['passenger_count']

In [196]:
df

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520
...,...,...,...,...,...
1048570,id0002921,1,06-04-2016 14:20,-73.976387,40.755604
1048571,id1329189,2,24-03-2016 01:38,-73.957039,40.712387
1048572,id0408460,1,23-02-2016 16:48,-73.998360,40.733360
1048573,id0147762,1,24-05-2016 07:25,-74.004250,40.707470
1048574,id0859354,2,15-03-2016 22:19,-74.005585,40.711521

In [197]:
locations = df[['dropoff_latitude', 'dropoff_longitude']]
locationlist = locations.values.tolist()
len(locationlist)

1048575

In [198]:
#You will have to obtain your own API keys and clientID


google_api_key = "AIzaSyCY3WIG9OtS3UyDbiZbqxdA35DvNdF698o"
# foursquare_client_id = "OC2R2FGC20MYGMDIV2PYIFF4DVE4BHQ4GSM2IPDQHYB4UXQH"
foursquare_client_id = "Q4YJPD5OOOOAOQKUKKI5UZSKXUADJJC3BGIITPDLTW0AT51Y"
# foursquare_client_secret = "1RMG1E3MYAJQB1MWO1UAFZKUCEM5DZN5TGAKHXLDZKLSO5P5"
foursquare_client_secret = "WISE2NNSQSXIDLNVSEVK3DD4IWNELSWJ20JRL3H00GEHMM3S"
VERSION = '20180605' # Foursquare API version

LIMIT = 7 # A default Foursquare API limit value

In [199]:
df['category'] = 0
df

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude,category
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602,0
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152,0
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087,0
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718,0
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520,0
...,...,...,...,...,...,...
1048570,id0002921,1,06-04-2016 14:20,-73.976387,40.755604,0
1048571,id1329189,2,24-03-2016 01:38,-73.957039,40.712387,0
1048572,id0408460,1,23-02-2016 16:48,-73.998360,40.733360,0
1048573,id0147762,1,24-05-2016 07:25,-74.004250,40.707470,0
1048574,id0859354,2,15-03-2016 22:19,-74.005585,40.711521,0

In [200]:
# create the API request URL
i=0
while( i<len(locationlist)):
    url = 'https://api.foursquare.com/v2/venues/explore?&client_id={}&client_secret={}&v={}&ll={},{}&limit={}'.format(
    foursquare_client_id, 
    foursquare_client_secret, 
    VERSION, 
    df.dropoff_latitude[i], 
    df.dropoff_longitude[i],
    LIMIT)
    # make the GET request
    result = requests.get(url).json()["response"]['groups'][0]['items']
    df['category'][i]=result[0]['venue']['categories'][0]['shortName']

KeyError: 'groups'

In [201]:
result = requests.get(url).json()["response"]

In [202]:
result

{}

In [203]:
df

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude,category
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602,0
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152,0
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087,0
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718,0
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520,0
...,...,...,...,...,...,...
1048570,id0002921,1,06-04-2016 14:20,-73.976387,40.755604,0
1048571,id1329189,2,24-03-2016 01:38,-73.957039,40.712387,0
1048572,id0408460,1,23-02-2016 16:48,-73.998360,40.733360,0
1048573,id0147762,1,24-05-2016 07:25,-74.004250,40.707470,0
1048574,id0859354,2,15-03-2016 22:19,-74.005585,40.711521,0

In [204]:
url = 'https://api.foursquare.com/v2/venues/explore?&client_id={}&client_secret={}&v={}&ll={},{}&limit={}'.format(
foursquare_client_id, 
foursquare_client_secret, 
VERSION, 
df.dropoff_latitude[4], 
df.dropoff_longitude[4],
LIMIT)
# make the GET request
result = requests.get(url).json()["response"]['groups'][0]['items']

KeyError: 'groups'

In [205]:
result[0]['venue']['categories'][0]['shortName']

KeyError: 0

In [206]:
dataframe = df[0:4500]

In [207]:
dataframe

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude,category
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602,0
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152,0
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087,0
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718,0
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520,0
...,...,...,...,...,...,...
4495,id2691561,2,08-06-2016 01:15,-73.990128,40.714241,0
4496,id2212354,1,20-02-2016 09:25,-73.970291,40.788223,0
4497,id1918139,2,29-06-2016 09:25,-73.951828,40.766701,0
4498,id1205436,1,23-06-2016 16:57,-73.983948,40.762890,0
4499,id1235185,1,18-03-2016 17:42,-73.987778,40.749943,0

In [208]:
i=0
while( i<len(locationlist)):
    url = 'https://api.foursquare.com/v2/venues/explore?&client_id={}&client_secret={}&v={}&ll={},{}&limit={}'.format(
    foursquare_client_id, 
    foursquare_client_secret, 
    VERSION, 
    dataframe.dropoff_latitude[i], 
    dataframe.dropoff_longitude[i],
    LIMIT)
    # make the GET request
    result = requests.get(url).json()["response"]['groups'][0]['items']
    dataframe['category'][i]=result[0]['venue']['categories'][0]['shortName']
    i=i+1

KeyError: 'groups'

In [ ]:
dataframe

In [209]:
dataframe[0:758]

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude,category
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602,0
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152,0
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087,0
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718,0
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520,0
...,...,...,...,...,...,...
753,id0744544,1,22-01-2016 22:54,-73.959007,40.763813,0
754,id0923913,2,03-06-2016 16:33,-73.981041,40.782150,0
755,id1761032,1,22-04-2016 09:44,-73.980003,40.745811,0
756,id1554407,2,20-01-2016 18:47,-73.985306,40.728394,0
757,id2438420,1,21-04-2016 19:05,-73.957306,40.768497,0

In [210]:
dateandtime= dataframe['dropoff_datetime'][0].split(" ")

In [211]:
dateandtime[1]

'17:32'

In [212]:
hourandmin = dateandtime[1].split(":")

In [213]:
hourandmin

['17', '32']

In [214]:
hour= hourandmin[0]
minute= hourandmin[1]

In [215]:
hour

'17'

In [216]:
minute

'32'

In [217]:
df1= dataframe[0:757]

df1

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude,category
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602,0
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152,0
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087,0
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718,0
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520,0
...,...,...,...,...,...,...
752,id1201454,2,03-01-2016 12:23,-73.963409,40.757496,0
753,id0744544,1,22-01-2016 22:54,-73.959007,40.763813,0
754,id0923913,2,03-06-2016 16:33,-73.981041,40.782150,0
755,id1761032,1,22-04-2016 09:44,-73.980003,40.745811,0
756,id1554407,2,20-01-2016 18:47,-73.985306,40.728394,0

In [218]:
# df1['time_hour'] =0 
# df1['time_minute'] = 0

df1

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude,category
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602,0
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152,0
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087,0
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718,0
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520,0
...,...,...,...,...,...,...
752,id1201454,2,03-01-2016 12:23,-73.963409,40.757496,0
753,id0744544,1,22-01-2016 22:54,-73.959007,40.763813,0
754,id0923913,2,03-06-2016 16:33,-73.981041,40.782150,0
755,id1761032,1,22-04-2016 09:44,-73.980003,40.745811,0
756,id1554407,2,20-01-2016 18:47,-73.985306,40.728394,0

In [219]:
# df1['day'] = 0
# df1['encoded_day']=0

def findDay(date):
    d = datetime.datetime.strptime(date, '%d-%m-%Y').weekday()
    return (calendar.day_name[d])

i=0
while(i<len(df1)):
    dateandtime= dataframe['dropoff_datetime'][i].split(" ")
    # print(dateandtime)
    
    date= dateandtime[0]
    day = findDay(date)
    df1.day[i] = day
    if(day=="Sunday"):
        df1['encoded_day'][i]= 0
    if(day=="Monday"):
        df1['encoded_day'][i]= 1
    if(day=="Tuesday"):
        df1['encoded_day'][i]= 2
    if(day=="Wednesday"):
        df1['encoded_day'][i]= 3
    if(day=="Thursday"):
        df1['encoded_day'][i]= 4
    if(day=="Friday"):
        df1['encoded_day'][i]= 5
    if(day=="Saturday"):
        df1['encoded_day'][i]= 6
        
    hrandmin = dateandtime[1].split(":")
    # print(hrandmin)
    hour= hrandmin[0]
    # print(hour + "::")
    df1.time_hour[i] = hour
    minute= hrandmin[1]
    # print(minute)
    df1.time_minute[i] = minute
    i=i+1

df1

AttributeError: 'DataFrame' object has no attribute 'day'

In [220]:
Places = {}

count = 0
for place in df1['category']:
    if place in Places:
        continue
    else:
        Places[place] = count
        count=count+1
for place in df1['category']:
    if place in Places:
        continue
    else:
        Places[place] = count
        count=count+1
        
Places

{0: 0}

In [221]:
df1['encoded_place'] = 0

for i,pl in enumerate(df1['category']):
    df1['encoded_place'][i] = Places[pl]
    
df1

,id,vendor_id,dropoff_datetime,dropoff_longitude,dropoff_latitude,category,encoded_place
0,id2875421,2,14-03-2016 17:32,-73.964630,40.765602,0,0
1,id2377394,1,12-06-2016 00:54,-73.999481,40.731152,0,0
2,id3858529,2,19-01-2016 12:10,-74.005333,40.710087,0,0
3,id3504673,2,06-04-2016 19:39,-74.012268,40.706718,0,0
4,id2181028,2,26-03-2016 13:38,-73.972923,40.782520,0,0
...,...,...,...,...,...,...,...
752,id1201454,2,03-01-2016 12:23,-73.963409,40.757496,0,0
753,id0744544,1,22-01-2016 22:54,-73.959007,40.763813,0,0
754,id0923913,2,03-06-2016 16:33,-73.981041,40.782150,0,0
755,id1761032,1,22-04-2016 09:44,-73.980003,40.745811,0,0
756,id1554407,2,20-01-2016 18:47,-73.985306,40.728394,0,0

In [222]:
X = df1[['time_hour','time_minute','encoded_day']]
y = df1['encoded_place']

# Splitting data into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Create kNN classifier
knn = KNeighborsClassifier()  # Fit the classifier to the data
knn.fit(X_train, y_train)

#kNN accuracy and other measures
y_pred = knn.predict(X_test)
print("k Nearest Neighbors model accuracy(in %):", knn.score(X_test, y_test)*100)

# Classification Report for kNN
predictions = knn.predict(X_test)
classi_report = classification_report(y_test, predictions)
print(classi_report)

KeyError: "None of [Index(['time_hour', 'time_minute', 'encoded_day'], dtype='object')] are in the [columns]"